# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on one-to-many and many-to-many relationships!

## Objectives

You will be able to:
- Query data using one-to-many and many-to-many joins
- Predict the resulting size of one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [2]:
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite')
c = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [18]:
#Your code here
c.execute("""SELECT firstName, lastName, city, state FROM employees JOIN offices USING (officecode) ORDER BY firstname asc""")

df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
len(df)

23

## Customers and their Orders (a One-to-Many join)

Return a list of all the customers first and last names along with a record for each of their order numbers, order dates and statuses.

In [17]:
c.execute("""SELECT contactFirstName, contactLastName, orderNumber, orderDate, status
            FROM customers
            JOIN orders
            USING (customerNumber)""")

df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
len(df)

326

## Customers and their Payments (another One-to-Many join)

Return a list of customers first and last names along with details about their payments including the amount and date of payments. Sort these results in descending order by the payment amount.

In [22]:
c.execute("""SELECT contactfirstName, contactlastName, checkNumber, amount, paymentDate FROM customers JOIN payments USING (customernumber);""")

df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
len(df)

273

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of customer first and last names, product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries which can make complex queries such as this much simpler!

In [34]:
c.execute("""SELECT contactFirstName, 
                    contactLastName, 
                    productName, 
                    quantityOrdered, 
                    orderDate 
            FROM customers
            JOIN orders
            USING (customerNumber)
            JOIN orderdetails
            USING (orderNumber)
            JOIN products
            USING (productCode)
            ORDER BY orderDate desc""")


df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df.head()

,contactFirstName,contactLastName,productName,quantityOrdered,orderDate
0,Janine,Labrune,1962 LanciaA Delta 16V,38,2005-05-31
1,Janine,Labrune,1957 Chevy Pickup,33,2005-05-31
2,Janine,Labrune,1998 Chrysler Plymouth Prowler,28,2005-05-31
3,Janine,Labrune,1964 Mercedes Tour Bus,38,2005-05-31
4,Janine,Labrune,1926 Ford Fire Engine,19,2005-05-31

## Summary

In this lab, you practiced your knowledge on one-to-many and many-to-many relationships!